<<<<<<< HEAD
<<<<<<< HEAD
# Оформление заказа
=======
# конфликт1 Оформление заказа
>>>>>>> markdown-branch
=======
# Оформление заказа
>>>>>>> markdown-branch
### Цель: 
*После наполнения пользователем корзины дать ему возможность указать недостающие параметры заказа, подтвердить корректность и перейти на шаг оплаты*

__*Основной сценарий:*__

1. После выбора всех интересующих пользователя позиций в меню он переходит в корзину
2. Здесь отображается перечень всех выбранных товаров и есть возможность: 
* добавить к заказу дополнительные непродуктового ряда (влажные салфетки, жевательную резинку) 
* удалить выбранные позиции 
3. Ограничение на сумму заказа - не менее 1 руб. Это необходимо на случай применения пользователем промокодов, скидки на день рождения, использования при оплате баллов лояльности. Все эти дополнительные опции должна быть возможность указать в соответствующих полях. Действие всех из них может суммироваться 
4. В корзине пользователь должен выбрать формат получения заказа: 
* это может быть самовывоз и тогда должен указать ресторан, откуда он его заберет;
* или доставка на указанный адрес, и тогда ему необходимо ввести его в соответствующее поле
5. Если выбрана доставка на адрес, то в рамках проверки корректности введенного необходима интеграция с всероссийским справочником адресов КЛАДР. Только при корректно заполненном адресе должна быть возможность перейти к шагу оплаты
6. Помимо адреса для доставки пользователь выбирает желаемый диапазон времени из предложенных. Предлагаемые варианты должны быть с шагом 30 мин
7. После заполнения всех параметров активизируется обязательный флаг “Я подтверждаю корректность заказа”, только после проставления которого становится активной кнопка “Оплатить”
8. Пользователь проверяет все введенные данные и переводит флаг “Я подтверждаю…” в положение ON
9. Кнопка “Оплатить” становится активной, заказ формируется, информация о нем отправляется через SOAP-сервис в вендорское ПО, где ведется учет заказов, заказ меняет статус на "Требует оплаты", ему присваивается уникальный номер, и пользователь перенаправляется на страницу для ввода данных карты. 

__*Альтернативный сценарий:*__

1. Пользователь заполняет все параметры заказа, но в качестве способа его получения выбирает не Доставку, а Самовывоз
2. В таком случае ему отображается карта города и на ней все доступные точки продажи сети с подробной информацией по каждой из них (адрес, режим работы, комментарии к местоположению), из которых ему  предлагается выбрать. Запрос списка активных точек производится из API вендора, предоставляющего ПО для ведения хозяйственной деятельности сети и учета заказов
3. После выбора конкретной точки для самовывоза пользователь выбирает время для него, проставляет флаг “Я подтверждаю…” и аналогично основному сценарию переходит к шагу оплаты со всеми сопутствующими этому внутренними процессами (см.п.9 выше)
***
__*Исключение:*__

1. Пользователь, сформировав корзину, прерывает оформление заказа, не вводит обязательные данные и закрывает сайт
2. Данные в корзине продолжают отображаться в течение 30 дней, после чего корзина автоматически очищается

 
